{
  "shifts": [
    {
      "id": 5,
      "name": "Michael Johnson",
      "body": "Planning and executing marketing campaigns to promote our products and reach new customers. Analyzing market trends and competitor strategies to refine our marketing approach. Conducting market research and gathering data to make informed marketing decisions.",
      "department": "Marketing",
      "date": "2023-10-27",
      "startTime": "08:30 AM",
      "endTime": "04:30 PM"
    },
    {
      "id": 6,
      "name": "Emily Brown",
      "body": "Providing HR support and guidance to employees, managing employee records, and ensuring compliance with HR policies and procedures. Conducting recruitment and onboarding processes for new hires and facilitating training programs.",
      "department": "HR",
      "date": "2023-10-27",
      "startTime": "01:00 PM",
      "endTime": "05:00 PM"
    },
    {
      "id": 7,
      "name": "David Wilson",
      "body": "Meeting with potential clients, understanding their needs, and presenting our products and services. Closing sales deals and achieving sales targets. Developing and maintaining strong client relationships to promote repeat business.",
      "department": "Sales",
      "date": "2023-10-28",
      "startTime": "10:00 AM",
      "endTime": "06:00 PM"
    },
    {
      "id": 8,
      "name": "Sophia Lee",
      "body": "Managing financial transactions, budgets, and financial reporting. Ensuring compliance with financial regulations and company financial policies. Conducting financial analysis to identify cost-saving opportunities and optimize financial performance.",
      "department": "Finance",
      "date": "2023-10-28",
      "startTime": "09:30 AM",
      "endTime": "05:30 PM"
    },
    {
      "id": 9,
      "name": "William Harris",
      "body": "Assisting customers with product inquiries, resolving customer issues, and providing top-notch customer service to enhance customer satisfaction. Monitoring customer feedback and making recommendations for improvements.",
      "department": "Customer Service",
      "date": "2023-10-29",
      "startTime": "12:00 PM",
      "endTime": "04:00 PM"
    },
    {
      "id": 10,
      "name": "Olivia Anderson",
      "body": "Managing operations to ensure efficient and smooth workflow. Overseeing production processes, inventory management, and quality control. Identifying operational bottlenecks and implementing process improvements.",
      "department": "Operations",
      "date": "2023-10-29",
      "startTime": "08:00 AM",
      "endTime": "12:00 PM"
    },
    {
      "name": "Alice Johnson",
      "body": "Coordinating HR activities, including recruitment, onboarding, and employee relations. Ensuring compliance with HR policies and regulations. Facilitating employee training and development programs.",
      "department": "HR",
      "date": "2023-10-06",
      "startTime": "08:00 AM",
      "endTime": "12:00 PM",
      "id": 11
    },
    {
      "name": "new",
      "body": "Test",
      "department": "",
      "date": "2023-10-12",
      "startTime": "23:45",
      "endTime": "23:46",
      "id": 12
    }
  ]
}